# Вам предоставлен список английских слов и словарь
# соответствия символов строки коду азбуки Морзе.
#
# Создайте функцию morse_encode(),
# которая принимает словарь с азбукой Морзе и слово
# для кодирования и возвращает его представление в
# азбуке Морзе с использованием пробелов между символами.

morse = {"0": "-----", "1": ".----", "2": "..---", "3": "...--", "4": "....-", "5": ".....", "6": "-....",
         "7": "--...", "8": "---..", "9": "----.", "a": ".-", "b": "-...", "c": "-.-.", "d": "-..", "e": ".",
         "f": "..-.", "g": "--.", "h": "....", "i": "..", "j": ".---", "k": "-.-", "l": ".-..", "m": "--",
         "n": "-.", "o": "---", "p": ".--.", "q": "--.-", "r": ".-.", "s": "...", "t": "-", "u": "..-",
         "v": "...-", "w": ".--", "x": "-..-", "y": "-.--", "z": "--..", ".": ".-.-.-", ",": "--..--",
         "?": "..--..", "!": "-.-.--", "-": "-....-", "/": "-..-.", "@": ".--.-.", "(": "-.--.", ")": "-.--.-"}

words_to_decode = ['java', 'python', 'ruby', 'php', 'fortran', 'javascript', 'kotlin', 'swift', 'basic', 'pascal']


# Пишите свой код ниже

def morse_encode(morse_dict, word):
    words_code = []

    for word_1 in word:
        morse_letter = []
        for letter in word_1.lower():  ## перебор букв в слове с приведением все к строчному виду
            code_m = morse_dict.get(letter)
            if code_m:  ## защита если вдруг в словаре не найдется нужной буквы или будет мусорный символ, если не True пропустит и вернет NONE
                morse_letter.append(code_m)

        words_code.append("".join(morse_letter))
    return " ".join(words_code)

print(morse_encode(morse, word='php'))