# Вам предоставлен словарь соответствия символов строки коду азбуки Морзе.
# Напишите функцию morse_decode(), которая принимает словарь с азбукой Морзе
# и строку в виде азбуки Морзе и возвращает декодированное слово.
# Символы в закодированной строке разделены пробелами.
# Пример работы функции:
#
# print(morse_decode(morse, "--. .- -- ."))
#
# >>> game

morse = {"0": "-----", "1": ".----", "2": "..---", "3": "...--", "4": "....-", "5": ".....", "6": "-....",
             "7": "--...", "8": "---..", "9": "----.", "a": ".-", "b": "-...", "c": "-.-.", "d": "-..", "e": ".",
             "f": "..-.", "g": "--.", "h": "....", "i": "..", "j": ".---", "k": "-.-", "l": ".-..", "m": "--",
             "n": "-.", "o": "---", "p": ".--.", "q": "--.-", "r": ".-.", "s": "...", "t": "-", "u": "..-",
             "v": "...-", "w": ".--", "x": "-..-", "y": "-.--", "z": "--..", ".": ".-.-.-", ",": "--..--",
             "?": "..--..", "!": "-.-.--", "-": "-....-", "/": "-..-.", "@": ".--.-.", "(": "-.--.", ")": "-.--.-"}

def morse_decode(morse_dict, morse_letters):

    word_decode = []

    morse_list = morse_letters.split()

    for morse_l in morse_list:


     for key, value in morse_dict.items():

            if morse_l == value:
                word_decode.append(key)

    return "".join(word_decode)




print(morse_decode(morse, '.--- .- ...- .-'))
